app/Controllers/TeamLeadController.php

SELECT COUNT(*) AS `numrows`
FROM `fastaginventory`
JOIN `fasttag` ON `fasttag`.`fasttagid` = `fastaginventory`.`fasttagid`
WHERE `fastaginventory`.`allotedto` = '60'
AND `fastaginventory`.`allotedtotype` = 2
SELECT `fastaginventory`.`fasttagid`, `fastaginventory`.`inventoryid`, `fastaginventory`.`allotedto`, `fastaginventory`.`allotedtotype`, `fastaginventory`.`status`, `fasttag`.`barcode`, `fasttag`.`tagid`, `fasttag`.`classoftag`
FROM `fastaginventory`
JOIN `fasttag` ON `fasttag`.`fasttagid` = `fastaginventory`.`fasttagid`
WHERE `fastaginventory`.`allotedto` = '60'
AND `fastaginventory`.`allotedtotype` = 2
 LIMIT 100, 100
---

        }

		$paginateData = $this->fastaginventory->select('fastaginventory.fasttagid,fastaginventory.inventoryid,fastaginventory.allotedto,fastaginventory.allotedtotype,fastaginventory.status,fasttag.barcode,fasttag.tagid,fasttag.classoftag')
         ->join('fasttag', 'fasttag.fasttagid = fastaginventory.fasttagid')
         ->where('fastaginventory.allotedto',$_SESSION['teamleadId'])
         ->where('fastaginventory.allotedtotype',2)
         ->paginate(100);