app/Models/SalesAgentModel.php

SELECT `salesagent`.`salesagentId`, `salesagent`.`salesAgentRegdNum`, `salesagent`.`Fname`, `salesagent`.`Lname`, `salesagent`.`ContactPrimary`, `salesagent`.`requestedById`, `salesagent`.`allowedIdCreation`, `salesagent`.`toll&city`, `salesagent`.`status`, `salesagent`.`bankdetailsid`, `salesagent`.`kycdetailsid`, `bankdetails`.`bankkycStatus`, `kycdetails`.`kycStatus`, `bankdetails`.`bankName`, `bankdetails`.`accountNumber`, `bankdetails`.`IFSCCode`, `bankdetails`.`bankkycStatus`, `nomeedetails`.`firstName`, `nomeedetails`.`lastName`, `nomeedetails`.`relationWith`, `nomeedetails`.`contactNumber`, `nomeedetails`.`idProof`, `kycdetails`.`aadharNumber`, `kycdetails`.`panCardNumber`, `kycdetails`.`drivingLicenceNumber`, `kycdetails`.`aadharProof`, `kycdetails`.`panCardProof`, `kycdetails`.`drivingLicenceProof`, `kycdetails`.`kycStatus`
FROM `salesagent`
JOIN `bankdetails` ON `salesagent`.`bankdetailsid` = `bankdetails`.`bankDetailsId`
JOIN `kycdetails` ON `salesagent`.`kycdetailsid` = `kycdetails`.`kycdetailsid`
JOIN `nomeedetails` ON `nomeedetails`.`nameeDetailsId` = `salesagent`.`nomineedetailsid`
WHERE `salesagent`.`requestedById` = '60'
---
  		public function showSelectdTeamAgent($idd){
            $builder = $this->db->table('salesagent');
            $builder->select('salesagent.salesagentId,salesagent.salesAgentRegdNum, salesagent.Fname ,salesagent.Lname, salesagent.ContactPrimary, salesagent.requestedById , salesagent.allowedIdCreation, salesagent.toll&city, salesagent.status,salesagent.bankdetailsid , salesagent.kycdetailsid,bankdetails.bankkycStatus,kycdetails.kycStatus,bankdetails.bankName,bankdetails.accountNumber,bankdetails.IFSCCode,bankdetails.bankkycStatus,nomeedetails.firstName,nomeedetails.lastName,nomeedetails.relationWith,nomeedetails.contactNumber,nomeedetails.idProof,kycdetails.aadharNumber,kycdetails.panCardNumber,kycdetails.drivingLicenceNumber,kycdetails.aadharProof,kycdetails.panCardProof,kycdetails.drivingLicenceProof,kycdetails.kycStatus');
            $builder->join('bankdetails', 'salesagent.bankdetailsid = bankdetails.bankDetailsId');
            $builder->join('kycdetails', 'salesagent.kycdetailsid = kycdetails.kycdetailsid');
            $builder->join('nomeedetails', 'nomeedetails.nameeDetailsId = salesagent.nomineedetailsid');
            $builder->where('salesagent.requestedById',$idd);
            $query   = $builder->get();