app/Models/SalesAgentWalletModel.php

SELECT *
FROM `wallet`
WHERE `payertype` = '1'
AND `payerid` = '145'
AND `transactionstatus` = 2
---
  	public function getWalletbalance($id,$typ){
      $builder = $this->db->table('wallet');
      $builder->select('*');
      $builder->where('payertype',$typ);
      $builder->where('payerid',$id);
      $builder->where('transactionstatus',2);
      $query   = $builder->get();